Revit 2026 API

# StructuralSectionConcreteTCantileverLength Property

---

Flange cantilever length.

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double CantileverLength { get; set; }
```
```vb
Public Property CantileverLength As Double
	Get
	Set
```
```cpp
public:
property double CantileverLength {
	double get ();
	void set (double value);
}
```
```fsharp
member CantileverLength : float with get, set
```

#### Property Value

Double

#### Reference

StructuralSectionConcreteT Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace